{
    "studentData": {
        "studentId": null,
        "recordId": null,
        "schoolId": null,
        "admissionNo": 984,
        "fullName": "SHIEKUMA TULE",
        "class": "DAY CARE 1",
        "classId": 16,
        "sectionId": 5,
        "studentCategory": "DAYCARE",
        "studentCategoryId": 1,
        "term": "FIRST TERM EXAMINATION - DEC/2025",
        "examTypeId": 5,
        "attendance": {
            "daysOpened": 134,
            "daysPresent": 104,
            "daysAbsent": 30
        }
    },
    "marksData": [
        {
            "subjectCode": "BIBLE",
            "subjectId": 24,
            "learningOutcome": "Tomuter may listen quietly during Bible story time without responding. However, he shows excitement when Bible songs and movements are included."
        },
        {
            "subjectCode": "PSED/PD",
            "subjectId": 36,
            "learningOutcome": "Tomuter shows growing confidence within the learning environment. He enjoys exploring and responds positively to his teachers and peers. He moves confidently and is developing good hand coordination during play activities."
        },
        {
            "subjectCode": "KUW/EAD",
            "subjectId": 31,
            "learningOutcome": "Tomuter's verbal responses are limited during class discussion. He demonstrates strong curiosity during hands-on activities. He scribbles and colours without aid."
        },
        {
            "subjectCode": "CLL/JP",
            "subjectId": 34,
            "learningOutcome": "Tomuter may be quiet during group communication moments. His excitement during activities shows developing awareness of an emerging ability to make connections through exploration. He may not join in verbally during Jolly Phonics sessions but he shows interest and excitement when songs and actions are introduced."
        },
        {
            "subjectCode": "PSRN",
            "subjectId": 30,
            "learningOutcome": "Tomuter may not respond verbally to counting or problem-solving prompts, but his engagement during activities shows emerging understanding. He enjoys stacking and exploring different kinds of toys through play."
        }
    ],
    "studentRatings": {
        "adherent_and_independent": null,
        "flexibility_and_creativity": null,
        "meticulous": null,
        "neatness": null,
        "overall_progress": null,
        "self_control_and_interaction": null
    },
    "teachersRemark": {
        "comment": null,
        "note": null
    }
}